app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def new
      @user=User.new(user_params)
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sainh01"], ["LIMIT", 1]]
---
      def login_form

      end
      user = User.find_by(username: params[:username])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def get_user

        @current_user ||= User.find_by(id: session[:user_id])
      if @current_user.nil?
        render json: {error: "Unauthorized", message: "you are not logged in"},status: :bad_request
        else
          if session[:user_id]== params[:id].to_i
            @user = User.find_by(id: params[:id].to_i)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def delete_user
      @current_user ||= User.find_by(id: session[:user_id])


      if @current_user.nil?
        render json: {error: "Unauthorized", message: "you are not logged in"},status: :bad_request


        else
          if session[:user_id]== params[:id].to_i
            user = User.find_by(id: params[:id].to_i).destroy

SELECT COUNT(*) FROM "users"
---
    def allUser
      page_number = params[:page] || 1
      @users = User.paginate(page: page_number, per_page: 10)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "123Sainisarita@gmail.com"], ["LIMIT", 1]]
---
      def resetMail_form

      end
      email = params[:email]
      user = User.find_by(email: email)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rajeshpushpakar01@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-08-22 08:36:59.262726"], ["id", 6]]
---
    def forget_password
    end
      verify = ::JsonWebToken.decode(params[:token])
        email = verify['email']
      user  = User.find_by(email: email)
     if user.update(password_params)